---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSizeIterator
source: html/24b02501-a69a-a52e-9b24-0ea7b79b5866.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator

An iterator to a set of MEP duct sizes from DuctSizes.

## Syntax (C#)
```csharp
public class DuctSizeIterator : IEnumerator<MEPSize>
```